app/controllers/entries_controller.rb

  def view_all
    @entries = Entry.all(:order => 'created_at DESC')
---
SELECT * FROM "entries" ORDER BY created_at DESC

  def index
    @entries = Entry.all
---
SELECT * FROM "entries"

  def show
    @entry = Entry.find(params[:id])
---
SELECT * FROM "entries" WHERE ("entries"."id" = 0)

  def create
    @entry = Entry.new(params[:entry])

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("title", "content", "created_at", "updated_at") VALUES('Test One', '<p>This is test 1</p>', '2011-11-20 02:06:14', '2011-11-20 02:06:14')